# Проект: Исследование стартапов

* Автор: Колдашев Виталий Андреевич
* Дата: 07.02.2025
* Ссылка на GitHub: https://github.com/PsychoCoderrr/YPracticumProjects/blob/main/FinalPythonProject.ipynb

## Введение

Стартапы играют ключевую роль в инновационной экономике, привлекая инвестиции, развивая технологии и создавая новые рынки. Однако не все стартапы успешно проходят путь от идеи до устойчивого бизнеса, и многие из них сталкиваются с трудностями в поиске финансирования, найме специалистов и выборе стратегии развития.

Цель данного исследования — проанализировать данные о стартапах, их финансировании и сотрудниках, чтобы выявить закономерности, влияющие на успешность компаний. В рамках проекта будет проведена предобработка и исследование нескольких датасетов, включающих информацию о раундах инвестиций, составе команд, образовании сотрудников и статусе компаний.

Основные задачи исследования:
* Оценить объем и динамику финансирования стартапов по годам.
* Изучить связь между размером компании и полнотой информации о сотрудниках.
* Проверить возможность объединения данных по ключевым параметрам.
* Проанализировать выбросы в данных, связанные с финансированием и продажей компаний.
* Исследовать, сколько раундов финансирования проходит стартап перед приобретением.

Результаты анализа помогут определить факторы, способствующие успеху стартапов, а также дадут представление о типичных инвестиционных тенденциях. Полученные выводы могут быть полезны как инвесторам, так и самим стартапам при принятии стратегических решений.

## Шаг 1. Знакомство с данными: загрузка и первичная предобработка

### Загрузка данных

In [2]:
!pip install phik -U
!pip install pandas -U

zsh:1: command not found: pip
zsh:1: command not found: pip

In [3]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [4]:
df_acquisition = pd.read_csv('https://code.s3.yandex.net/datasets/acquisition.csv')

In [11]:
df_company = pd.read_csv('https://code.s3.yandex.net/datasets/company_and_rounds.csv')

In [12]:
df_degrees = pd.read_csv('https://code.s3.yandex.net/datasets/degrees.csv')

In [13]:
df_education = pd.read_csv('https://code.s3.yandex.net/datasets/education.csv')

In [14]:
df_fund = pd.read_csv('https://code.s3.yandex.net/datasets/fund.csv')

In [15]:
df_investment = pd.read_csv('https://code.s3.yandex.net/datasets/investment.csv')

In [7]:
df_people = pd.read_csv('https://code.s3.yandex.net/datasets/people.csv')

### 1.1. Вывод общей информации, исправление названия столбцов

In [8]:
df_acquisition.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9407 entries, 0 to 9406
Data columns (total 6 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   id                    9407 non-null   int64
 1   acquiring_company_id  9407 non-null   int64
 2   acquired_company_id   9407 non-null   int64
 3   term_code             1831 non-null   object
 4   price_amount          9407 non-null   int64
 5   acquired_at           9378 non-null   object
dtypes: int64(4), object(2)
memory usage: 441.1+ KB

In [9]:
df_acquisition.head()

,id,acquiring_company_id,acquired_company_id,term_code,price_amount,acquired_at
0,1,11,10,NaN,20000000,2007-05-30
1,7,59,72,cash,60000000,2007-07-01
2,8,24,132,cash,280000000,2007-05-01
3,9,59,155,cash,100000000,2007-06-01
4,10,212,215,cash,25000000,2007-07-01

In [16]:
df_company.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 217774 entries, 0 to 217773
Data columns (total 22 columns):
 #   Column                 Non-Null Count   Dtype
---  ------                 --------------   -----
 0   company  ID            217472 non-null  float64
 1   name                   217471 non-null  object
 2   category  code         143886 non-null  object
 3   status                 217472 non-null  object
 4   founded  at            109956 non-null  object
 5   closed  at             3449 non-null    object
 6   domain                 147159 non-null  object
 7   network  username      95534 non-null   object
 8   country  code          108607 non-null  object
 9   investment  rounds     217472 non-null  float64
 10  funding  rounds        217472 non-null  float64
 11  funding  total         217472 non-null  float64
 12  milestones             217472 non-null  float64
 13  funding  round  id     52928 non-null   float64
 14  company  id            52928 non-null   float64
 15  funded  at             52680 non-null   object
 16  funding  round  type   52928 non-null   object
 17  raised  amount         52928 non-null   float64
 18  pre  money  valuation  52928 non-null   float64
 19  participants           52928 non-null   float64
 20  is  first  round       52928 non-null   float64
 21  is  last  round        52928 non-null   float64
dtypes: float64(12), object(10)
memory usage: 36.6+ MB

In [17]:
df_company.head()

,company ID,name,category code,status,founded at,closed at,domain,network username,country code,investment rounds,...,milestones,funding round id,company id,funded at,funding round type,raised amount,pre money valuation,participants,is first round,is last round
0,1.0,Wetpaint,web,operating,2005-10-17,NaN,wetpaint-inc.com,BachelrWetpaint,USA,0.0,...,5.0,888.0,1.0,2005-10-01,series-a,5250000.0,0.0,2.0,0.0,1.0
1,1.0,Wetpaint,web,operating,2005-10-17,NaN,wetpaint-inc.com,BachelrWetpaint,USA,0.0,...,5.0,889.0,1.0,2007-01-01,series-b,9500000.0,0.0,3.0,0.0,0.0
2,1.0,Wetpaint,web,operating,2005-10-17,NaN,wetpaint-inc.com,BachelrWetpaint,USA,0.0,...,5.0,2312.0,1.0,2008-05-19,series-c+,25000000.0,0.0,4.0,1.0,0.0
3,10.0,Flektor,games_video,acquired,NaN,NaN,flektor.com,NaN,USA,0.0,...,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,100.0,There,games_video,acquired,NaN,NaN,there.com,NaN,USA,0.0,...,4.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [18]:
df_degrees.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 109610 entries, 0 to 109609
Data columns (total 4 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   id           109610 non-null  int64
 1   object_id    109610 non-null  object
 2   degree_type  98389 non-null   object
 3   subject      81298 non-null   object
dtypes: int64(1), object(3)
memory usage: 3.3+ MB

In [19]:
df_degrees.head()

   id object_id degree_type                       subject
0   1    p:6117         MBA                           NaN
1   2    p:6136          BA               English, French
2   3    p:6136          MS            Mass Communication
3   4    p:6005          MS           Internet Technology
4   5    p:5832         BCS  Computer Science, Psychology

In [20]:
df_education.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 109610 entries, 0 to 109609
Data columns (total 4 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   id            109610 non-null  int64
 1   person_id     109610 non-null  int64
 2   instituition  109555 non-null  object
 3   graduated_at  58054 non-null   object
dtypes: int64(2), object(2)
memory usage: 3.3+ MB

In [21]:
df_education.head()

   id  person_id                      instituition graduated_at
0   1       6117                               NaN          NaN
1   2       6136  Washington University, St. Louis   1990-01-01
2   3       6136                 Boston University   1992-01-01
3   4       6005           University of Greenwich   2006-01-01
4   5       5832                   Rice University          NaN

In [22]:
df_fund.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11652 entries, 0 to 11651
Data columns (total 9 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   id                  11652 non-null  int64
 1   name                11649 non-null  object
 2   founded_at          4605 non-null   object
 3   domain              7362 non-null   object
 4   network_username    2149 non-null   object
 5   country_code        7053 non-null   object
 6   investment_rounds   11652 non-null  int64
 7   invested_companies  11652 non-null  int64
 8   milestones          11652 non-null  int64
dtypes: int64(4), object(5)
memory usage: 819.4+ KB

In [23]:
df_fund.head()

,id,name,founded_at,domain,network_username,country_code,investment_rounds,invested_companies,milestones
0,13131,NaN,NaN,NaN,NaN,NaN,0,0,0
1,1,Greylock Partners,1965-01-01,greylock.com,greylockvc,USA,307,196,0
2,10,Mission Ventures,1996-01-01,missionventures.com,NaN,USA,58,33,0
3,100,"Kapor Enterprises, Inc.",NaN,kei.com,NaN,USA,2,1,0
4,1000,Speed Ventures,NaN,NaN,NaN,NaN,0,0,1

In [25]:
df_investment.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 61403 entries, 0 to 61402
Data columns (total 4 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   id                61403 non-null  int64
 1   funding_round_id  61403 non-null  int64
 2   company_id        61403 non-null  int64
 3   fund_id           61403 non-null  int64
dtypes: int64(4)
memory usage: 1.9 MB

In [26]:
df_investment.head()

   id  funding_round_id  company_id  fund_id
0   1                 1           4        1
1   2                 1           4        2
2   3                 3           5        4
3   4                 4           5        1
4   5                 4           5        5